posts/2018-12-24-a-gift-for-us.org
#+title: A Gift for Us
#+date: <2018-12-24>
#+filetags: music religion


This is a Christmas communion hymn, titled "A Gift for Us." I wrote the lyrics last year, and Cheryl Tarter has written some wonderful music for it. It debuts at tonight's candlelight service at NorthHaven Church.\\

Into our darkness, there came a light,\\
As a babe was born on that holy night;\\
The angels sang and the shepherds prayed\\
When the Son of God in a manger lay.\\

As we eat this bread and drink this cup,\\
We remember that child, a gift for us.\\
As we eat this bread and drink this cup,\\
We remember that child, a gift for us.\\

The fullness of God in human form,\\
Was that night, in Bethlehem born;\\
Giving up his throne in heaven above,\\
To teach us to serve, to give, and to love.\\

As we eat this bread and drink this cup,\\
We remember Jesus, a gift for us.\\
As we eat this bread and drink this cup,\\
We remember Jesus, a gift for us.\\

He came to this world, in all its strife,\\
For our sins, to give his life;\\
Lifted up, with his arms held wide,\\
The Son of God was crucified.\\

As we eat this bread and drink this cup,\\
We remember our Lord, a gift for us.\\
As we eat this bread and drink this cup,\\
We remember our Lord, a gift for us.


#+begin_tagline
Tagged: music religion
#+end_tagline
