docs/posts/2018-12-24-a-gift-for-us.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Gift for Us</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">A Gift for Us</h1>
<p class="subtitle" role="doc-subtitle">Dec 24, 2018</p>
</header><p>
This is a Christmas communion hymn, titled &ldquo;A Gift for Us.&rdquo; I wrote the lyrics last year, and Cheryl Tarter has written some wonderful music for it. It debuts at tonight&rsquo;s candlelight service at NorthHaven Church.<br>
</p>

<p>
Into our darkness, there came a light,<br>
As a babe was born on that holy night;<br>
The angels sang and the shepherds prayed<br>
When the Son of God in a manger lay.<br>
</p>

<p>
As we eat this bread and drink this cup,<br>
We remember that child, a gift for us.<br>
As we eat this bread and drink this cup,<br>
We remember that child, a gift for us.<br>
</p>

<p>
The fullness of God in human form,<br>
Was that night, in Bethlehem born;<br>
Giving up his throne in heaven above,<br>
To teach us to serve, to give, and to love.<br>
</p>

<p>
As we eat this bread and drink this cup,<br>
We remember Jesus, a gift for us.<br>
As we eat this bread and drink this cup,<br>
We remember Jesus, a gift for us.<br>
</p>

<p>
He came to this world, in all its strife,<br>
For our sins, to give his life;<br>
Lifted up, with his arms held wide,<br>
The Son of God was crucified.<br>
</p>

<p>
As we eat this bread and drink this cup,<br>
We remember our Lord, a gift for us.<br>
As we eat this bread and drink this cup,<br>
We remember our Lord, a gift for us.
</p>


<div class="tagline" id="org593c819">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
